// 예제1
// 사용자 정보를 가져오는 비동기 함수를 작성하고, 이를 async/await를 사용하여 호출하시오
// const users = {
//   1: { name: "kim", age: 25 },
//   2: { name: "Lee", age: 30 },
//   3: { name: "Jung", age: 35 },
// };

// 예제2
//  1초 후에 "A를", 2초 후에 "B"를 반환하는 두 개의 Promise를 생성하고, 두 Promise가 모두 완료된 후에 "완료!"를 출력하세요.

// 예제3
// 1초 후에 숫자 5를 반환하는 Promise와 1.5초 후에 그 숫자에 10을 곱한 값을 반환하는 Promise를 작성하세요.
// 만약 5를 반환하는 Promise가 실패하면 "에러!"를 출력하세요.

// 예제4
// 제너레이터를 사용하여 여러 비동기 작업을 순차적으로 실행하는 함수를 작성하세요. 각 작업은 2초 후에완료된다고
// 가정하고, 작업이 완료될 때마다 그 결과를 출력해야 합니다. 제너레이터는 작업이 완료될 때마다 다음 작업을 실행해야 합니다.......
